# 중복 데이터(레코드, 엔트리, 관측값, 행) 처리

- 중복 여부 체크 : duplicated()  
                    - keep
                    - subset  
                    
- 중복 제거 : drop_duplicates()

In [16]:
import pandas as pd

df = pd.DataFrame([[1,2,3], [1,2,1],[1,2,3]], 
                 columns=['a','b','c'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [17]:
df

   a  b  c
0  1  2  3
1  1  2  1
2  1  2  3

In [18]:
# 중복 데이터(행, row) 체크  =>  duplicated()  =>  기본값음 keep='first'
# 아래로 내려가면서 확인함 (기본값)
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [19]:
df.duplicated(keep='last') # 중복된 마지막 것을 유지하겠다 (<-> 'first')

0     True
1    False
2    False
dtype: bool

In [20]:
df.duplicated(keep=False) # 전부 중복된 것이라고 마킹해두겠다

0     True
1    False
2     True
dtype: bool

In [21]:
df

   a  b  c
0  1  2  3
1  1  2  1
2  1  2  3

In [22]:
# 특정 컬럼의 동일여부 => subset[컬럼명]  # keep = 'first'인 상황
df.duplicated(subset=['b'])

0    False
1     True
2     True
dtype: bool

In [23]:
# 행 기준이면 0과 2가 같은데, 열 기준이면 'b'만 본다면 다 같아서 0만

In [25]:
df.duplicated(subset=['b','c']) # 'b'와 'c' 두개의 기준이니까

0    False
1    False
2     True
dtype: bool

In [26]:
# 'first'니까 처음 발견되는 애는 False, 그 담부터는 지워지고

In [28]:
# 2) 중복 제거하기 => drop_duplicates(subset, keep)
print(df)
df.drop_duplicates()  # 0행과 2행이 같아서 2행이 지워짐

   a  b  c
0  1  2  3
1  1  2  1
2  1  2  3

   a  b  c
0  1  2  3
1  1  2  1

In [29]:
df.drop_duplicates(subset=['b'])

   a  b  c
0  1  2  3

In [30]:
# 'b' 열 기준으로 보면 2로 다 같으니까, 'first'인 0행의 2만 살고 나머지는 다 지워짐